Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_complaints/making_a_complaint_about_telecommunications_or_postal_services.html.txt.tmx
Source language: en
Languages: ga

source: Making a complaint about telecommunications or postal services
ga: Ag déanamh gearáin faoi sheirbhísí teileachumarsáide nó seirbhísí poist

source: The Commission for Communications Regulation (ComReg) is the statutory body charged with regulation of the electronic communications and postal sector, including premium rate telephone services
ga: Is iad an Coimisiún um Rialáil Cumarsáide (ComReg) an comhlacht reachtúil atá freagrach as rialáil a dhéanamh ar chumarsáid leictreonach agus an earnáil phoist, lena n-áirítear seirbhísí gutháin ardráta

source: It also deals with unresolved complaints about telecommunications and postal services
ga: Déileálann siad freisin le gearáin neamh-réitithe faoi sheirbhísí teileachumarsáide agus seirbhísí poist

source: ComReg has produced a guide to your rights when making a complaint about your service provider
ga: Tá treoir do na chearta atá agat maidir le gearán a dhéanamh faoi sholáthraí de sheirbhísí curtha amach ag ComReg

source: Where should I complain?
ga: Cén áit ar cheart dom an gearán a dhéanamh?

source: If you have an issue with your service provider, you should first contact your provider, outline your complaint and ask for it to be resolved
ga: Más fadhb atá agat le soláthraí do sheirbhíse ba cheart duit teagmháil a dhéanamh leo siúd ar dtúis, déan cur síos gairid ar ábhar do ghearáin agus iarr orthu réiteach a sholáthar

source: It is important to act quickly and be aware of any time limits that may apply to making a complaint
ga: Is tábhachtach gníomhú go tapa agus a bheith feasach ar aon teorainneacha ama a d’fhéadfadh baint le gearán a dhéanamh

source: Your provider should have a code of practice for handling complaints
ga: Ba chóir go mbeadh cód cleachtais ag an soláthraí chun gearáin a láimhseáil

source: Try to be clear about the issue by providing enough details when making the complaint to your service provider
ga: Bí chomh soiléir agus is féidir leat faoi gceist agus tabhair oiread sonraí agus is gá le linn duit a bheith ag déanamh an ghearáin

source: Record the date and time that you make your complaint and ask for a reference number for your complaint
ga: Cur síos an t-am agus an dáta a rinne tú an gearán agus iarr uimhir thagartha don ghearán

source: Make a note of the name of the person who takes your complaint
ga: Cur síos ainm an duine a ghlac an gearán uait

source: Give your service provider a chance to resolve your complaint
ga: Tabhair caoi agus am don soláthraí chun an cheist a réiteach

source: Make a note of any commitments that are made by your provider
ga: Déan nóta d’aon ghealltanais a thugann an soláthraí duit

source: ComReg provides further information to assist you when making a complaint to your telecommunications or postal service provider on its consumer website www.askcomreg.ie
ga: Soláthraíonn ComReg breis faisnéise chun cabhrú leat nuair a bhíonn gearán á dhéanamh agat le do sholáthraí seirbhísí teileachumarsáide nó poist ar a láithreán gréasáin do thomhaltóirí, www.askcomreg.ie

source: Advice for consumers on making a complaint about premium rate telephone services is also available on ComReg’s website
ga: Tá fáil ar chomhairle ar ghearán a dhéanamh faoi sheirbhísí gutháin ardráta chomh maith ar láithreán gréasáin ComReg

source: Who can complain to ComReg?
ga: Cé tá i dteideal gearán a dhéanamh le ComReg?

source: If you have used your service provider's complaint procedure and you are not satisfied with the outcome, you can complain to ComReg
ga: Má d’úsáid tú nós imeachta gearáin do sholáthraí agus mura bhfuil tú sásta leis an toradh, féadfaidh tú gearán a dhéanamh le ComReg

source: ComReg cannot act on a consumer complaint until the service provider’s complaint handling process is completed
ga: Ní féidir le ComReg gníomhú ar ghearán tomhaltóra go dtí go gcríochnaítear próiseas láimhseála gearáin sholáthar na seirbhíse

source: The issue giving rise to your complaint must have occurred within the previous 9 months for telecommunications issues
ga: Ní mór d’aon ghearán le ComReg a bhaineann le cúrsaí teileachumarsáide a bheith déanta laistigh de 9 mí ón uair a tharla an eachtra is ábhar don ghearán

source: However, you must make your complaint within 3 months of the use of a premium rate service
ga: Ní mór gearáin a dhéanamh taobh istigh de 3 mhí ón am a úsáideann tú seirbhís gutháin ag ardráta

source: There is no charge for making a complaint to ComReg
ga: Níl táille ar bith ar ghearán a dhéanamh le ComReg

source: If you wish to make a complaint to ComReg, you can make it by phone, fax, e-mail or by post
ga: Más maith leat gearán a dhéanamh le ComReg, tig leat é a dhéanamh ar teileafón, ar facs, ar ríomhphost nó tríd an ghnáthphost

source: You can also complete an online complaint form
ga: Tig leat freisin foirm ghearáin ar líne a chur isteach

source: What details should I give about my complaint?
ga: Cad iad na sonraí ba cheart dom a thabhairt sa ghearán?

source: When you contact ComReg you should provide the following:
ga: Nuair a theagmhaíonn tú le ComReg ba cheart duit an t-eolas seo a thabhairt:

source: • Your contact details including a mobile telephone number if possible for telecoms complaints, and full postal address for postal complaints
ga: • Sonraí teagmhála, cur i gcás uimhir fóin phóca, más féidir, i gcomhair gearán teileachumarsáide, agus seoladh iomlán poist i gcomhair gearán poist

source: • The account name and account number (if applicable)
ga: • Ainm agus uimhir an chuntais (más ábhartha)

source: • Details of the complaint, including the complaint reference number
ga: • Sonraí an ghearáin, uimhir thagartha san áireamh

source: • Details about previous dealings with the service provider
ga: • Sonraí faoi dhéileálacha leis an soláthraí céanna roimhe sin

source: • A clear statement of what you hope to achieve by raising your complaint
ga: • Ráiteas soiléir faoin dtoradh a bheadh súil agat leis as an ngearán a dhéanamh

source: When you are giving your information, you should let Comreg know if there are any particular details that you do not want ComReg to send to the service provider
ga: Le linn duit a bheith ag tabhairt an eolais, má tá sonraí ar bith nach mian leat a thabhairt don soláthraí seirbhíse, ba cheart duit é sin a rá le ComReg

source: If you have used your service provider’s complaint procedure and you are not satisfied with the outcome, you can complain to ComReg
ga: Má tá an nós imeachta gearáin do sholáthraí seirbhíse úsáidte agat agus mura bhfuil tú sásta leis an toradh nó an freagra, ansin is féidir leat gearán a dhéanamh le ComReg
